In [1]:
import pandas as pd

In [2]:
fc_convert1 = pd.read_csv('C:/sas_view/use_code/rc16.csv', index_col= 0)
fc_convert2 = pd.read_csv('C:/sas_view/use_code/rc17.csv', index_col= 0)
fc_convert3 = pd.read_csv('C:/sas_view/use_code/rc18.csv', index_col= 0)
fc_convert4 = pd.read_csv('C:/sas_view/use_code/rc19.csv', index_col= 0)
fc_convert5 = pd.read_csv('C:/sas_view/use_code/rc20.csv', index_col= 0)

In [3]:
# ID, 음식코드 추출 작업

N_CODE_convert1 = fc_convert1[['ID','N_DCODE']]
N_CODE_convert2 = fc_convert2[['ID','N_DCODE']]
N_CODE_convert3 = fc_convert3[['ID','N_DCODE']]
N_CODE_convert4 = fc_convert4[['ID','N_DCODE']]
N_CODE_convert5 = fc_convert5[['ID','N_DCODE']]

In [4]:
for i in range(0, len(N_CODE_convert1)):
    N_CODE_convert1.iloc[i][0] = N_CODE_convert1.iloc[i][0][2:-1]
    N_CODE_convert1.iloc[i][1] = N_CODE_convert1.iloc[i][1][3:-1]

In [5]:
for i in range(0, len(N_CODE_convert2)):
    N_CODE_convert2.iloc[i][0] = N_CODE_convert2.iloc[i][0][2:-1]
    N_CODE_convert2.iloc[i][1] = N_CODE_convert2.iloc[i][1][3:-1]

In [6]:
for i in range(0, len(N_CODE_convert3)):
    N_CODE_convert3.iloc[i][0] = N_CODE_convert3.iloc[i][0][2:-1]
    N_CODE_convert3.iloc[i][1] = N_CODE_convert3.iloc[i][1][3:-1]

In [7]:
for i in range(0, len(N_CODE_convert4)):
    N_CODE_convert4.iloc[i][0] = N_CODE_convert4.iloc[i][0][2:-1]
    N_CODE_convert4.iloc[i][1] = N_CODE_convert4.iloc[i][1][3:-1]

In [8]:
for i in range(0, len(N_CODE_convert5)):
    N_CODE_convert5.iloc[i][0] = N_CODE_convert5.iloc[i][0][2:-1]
    N_CODE_convert5.iloc[i][1] = N_CODE_convert5.iloc[i][1][3:-1]

In [12]:
code_data1 = pd.read_excel('C:/sas_view/use_code/2016_영양조사_코드자료집.xlsx', sheet_name = 3)
code_data2 = pd.read_excel('C:/sas_view/use_code/2017_영양조사_코드자료집.xlsx', sheet_name = 3)
code_data3 = pd.read_excel('C:/sas_view/use_code/2018_영양조사_코드자료집.xlsx', sheet_name = 3)
code_data4 = pd.read_excel('C:/sas_view/use_code/2019_영양조사_코드자료집.xlsx', sheet_name = 3)
code_data5 = pd.read_excel('C:/sas_view/use_code/2020_영양조사_코드자료집.xlsx', sheet_name = 3)
code_data1

      음식코드             음식코드명
0      101               감자밥
1      102              고구마밥
2      103                국밥
3      104            김밥(대표)
4      105             김밥,고추
...    ...               ...
1778  5009  커피,카페모카,카라멜,휘핑크림
1779  5010      커피,카페모카,휘핑크림
1780  5701               칠면조
1781  5702               과메기
1782  9999             식이보충제

[1783 rows x 2 columns]

In [17]:
code_data1.rename(columns = {'음식코드':'N_DCODE'}, inplace=True)
code_data2.rename(columns = {'음식코드':'N_DCODE'}, inplace=True)
code_data3.rename(columns = {'음식코드':'N_DCODE'}, inplace=True)
code_data4.rename(columns = {'음식코드':'N_DCODE'}, inplace=True)
code_data5.rename(columns = {'음식코드':'N_DCODE'}, inplace=True)

code_data1

      N_DCODE             음식코드명
0         101               감자밥
1         102              고구마밥
2         103                국밥
3         104            김밥(대표)
4         105             김밥,고추
...       ...               ...
1778     5009  커피,카페모카,카라멜,휘핑크림
1779     5010      커피,카페모카,휘핑크림
1780     5701               칠면조
1781     5702               과메기
1782     9999             식이보충제

[1783 rows x 2 columns]

In [33]:
N_CODE_convert1.loc[:,'N_DCODE'] = N_CODE_convert1.loc[:,'N_DCODE'].astype('int64')
N_CODE_convert2.loc[:,'N_DCODE'] = N_CODE_convert2.loc[:,'N_DCODE'].astype('int64')
N_CODE_convert3.loc[:,'N_DCODE'] = N_CODE_convert3.loc[:,'N_DCODE'].astype('int64')
N_CODE_convert4.loc[:,'N_DCODE'] = N_CODE_convert4.loc[:,'N_DCODE'].astype('int64')
N_CODE_convert5.loc[:,'N_DCODE'] = N_CODE_convert5.loc[:,'N_DCODE'].astype('int64')

C:\Users\User\AppData\Local\Temp\ipykernel_8256\1994200886.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  N_CODE_convert1.loc[:,'N_DCODE'] = N_CODE_convert1.loc[:,'N_DCODE'].astype('int64')

In [34]:
N_CODE_convert1.loc[:,'N_DCODE']
N_CODE_convert2.loc[:,'N_DCODE']
N_CODE_convert3.loc[:,'N_DCODE']
N_CODE_convert4.loc[:,'N_DCODE']
N_CODE_convert5.loc[:,'N_DCODE']

0          159
1          159
2         1372
3         1372
4         1372
          ...
548234    1402
548235    1402
548236    1457
548237    1457
548238    1457
Name: N_DCODE, Length: 548239, dtype: int64

In [28]:
code_data1.loc[:,'N_DCODE']
code_data2.loc[:,'N_DCODE']
code_data3.loc[:,'N_DCODE']
code_data4.loc[:,'N_DCODE']
code_data5.loc[:,'N_DCODE']

0        101
1        102
2        103
3        104
4        105
        ...
1778    5009
1779    5010
1780    5701
1781    5702
1782    9999
Name: N_DCODE, Length: 1783, dtype: int64

In [35]:
N_CODE_convert1.merge(code_data1)
N_CODE_convert2.merge(code_data2)
N_CODE_convert3.merge(code_data3)
N_CODE_convert4.merge(code_data4)
N_CODE_convert5.merge(code_data5)

                ID  N_DCODE  음식코드명
0       A651172801      159  현미밥,쌀
1       A651172801      159  현미밥,쌀
2       A651172802      159  현미밥,쌀
3       A651172802      159  현미밥,쌀
4       A652177903      159  현미밥,쌀
...            ...      ...    ...
548234  R653336002     1450   새우무침
548235  R653336002     1450   새우무침
548236  R653336002     1450   새우무침
548237  R653336002     1450   새우무침
548238  R653336002     1450   새우무침

[548239 rows x 3 columns]

                ID  N_DCODE  N_DCODE   음식코드명
0       A651172801     0159    101.0     감자밥
1       A651172801     0159    102.0    고구마밥
2       A651172801     1372    103.0      국밥
3       A651172801     1372    104.0  김밥(대표)
4       A651172801     1372    105.0   김밥,고추
...            ...      ...      ...     ...
548234  R654370003     1402      NaN     NaN
548235  R654370003     1402      NaN     NaN
548236  R654370003     1457      NaN     NaN
548237  R654370003     1457      NaN     NaN
548238  R654370003     1457      NaN     NaN

[548239 rows x 4 columns]